package homework2;

import java.util.Arrays;

public class Task2_3 {
    /*
    Задача 3:
Используя for вывести каждое четное число от 2 до 20 включительно и больше 10.
     */
    public static void main(String[] args) {
        for (int i = 10; i <= 20; i += 2) {
            System.out.println(i);
        }
    }
}
